{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two UI-related features and the files they modify.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files.",
  "frontend/index.css": "Tailwind base layer defining the global OKLCH color theme, light/dark variables, and default border/background styles.",
  "frontend/index.html": "Main HTML entry with font imports and root element for mounting the React app.",
  "frontend/src/App.tsx": "Top-level React component assembling all marketing sections with a global background texture.",
  "frontend/src/components/marketing/Card.tsx": "Reusable styled card component with border, padding, and hover shadow.",
  "frontend/src/components/marketing/ContactForm.tsx": "Interactive contact form with validation, simulated submission, and success/error states.",
  "frontend/src/components/marketing/Footer.tsx": "Footer showing logo, contact details, and copyright line.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Sticky responsive header with logo, scroll-linked navigation, mobile sheet menu, and a photo placeholder box.",
  "frontend/src/components/marketing/Section.tsx": "Wrapper component providing consistent section spacing and scroll margin.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "About section with text, highlight list, and a photo placeholder box.",
  "frontend/src/components/marketing/sections/ColorPlaceholdersSection.tsx": "Renders a grid of 12 color placeholders with images-to-be-added and note inputs stored in component state.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Displays contact information and embeds a contact form with fields for email, phone, and location placeholders.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Hero banner with headline, description, and buttons that smooth-scroll to the contact and about sections.",
  "frontend/src/components/marketing/sections/ProcessSection.tsx": "Shows a four-step workflow with icons and descriptions presented in a responsive grid.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Simple section describing available Chaniya Choli services for bridal and sider use.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Empty file intended for a testimonials section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, identity loading, and status handling.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, typography, global resets, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, fonts, container settings, animations, and plugins.",
  "project_state.json": "Defines the project’s current website requirements, theme directions, and existing implemented features for a minimalistic marketing site. Includes architectural notes about color palette updates, an About-section photo placeholder, and removal of colored overlays on images."
}