{
  "backend/main.mo": "Minimal Motoko actor with no behavior.",
  "feature_evidence.json": "Evidence report listing files and components related to implementing default-on maintenance mode.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files and components for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens, dark mode variants, and global background/text styling.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app root.",
  "frontend/src/App.tsx": "Main app that toggles between maintenance screen and full marketing site based on MAINTENANCE_MODE.",
  "frontend/src/components/maintenance/MaintenanceScreen.tsx": "Centered full-page message indicating the site is unavailable.",
  "frontend/src/components/marketing/Card.tsx": "Reusable styled card container with border, padding, and hover shadow.",
  "frontend/src/components/marketing/ContactForm.tsx": "Form with client-side validation, simulated submission, and success/error handling.",
  "frontend/src/components/marketing/Footer.tsx": "Footer with logo, contact info placeholders, and copyright line.",
  "frontend/src/components/marketing/HeaderNav.tsx": "Sticky header with navigation, active section tracking, smooth scroll, and mobile menu.",
  "frontend/src/components/marketing/Section.tsx": "Generic section wrapper with spacing and scroll margin.",
  "frontend/src/components/marketing/sections/AboutSection.tsx": "About section with bio text, highlights list, and photo placeholder box.",
  "frontend/src/components/marketing/sections/ColorPlaceholdersSection.tsx": "Displays a grid of 12 color placeholders with note inputs using local state.",
  "frontend/src/components/marketing/sections/ContactSection.tsx": "Renders a contact section with email, placeholders for phone and location, and an embedded contact form.",
  "frontend/src/components/marketing/sections/HeroSection.tsx": "Provides a hero banner with headline text and buttons that smoothly scroll to other sections.",
  "frontend/src/components/marketing/sections/ProcessSection.tsx": "Shows a four-step process with icons and descriptions laid out in a responsive grid.",
  "frontend/src/components/marketing/sections/ServicesSection.tsx": "Simple services section describing Chaniya Choli offerings.",
  "frontend/src/components/marketing/sections/TestimonialsSection.tsx": "Empty file intended for a testimonials section.",
  "frontend/src/config/maintenance.ts": "Defines a site-wide maintenance mode flag currently set to true.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/index.css": "Global Tailwind styles defining color variables, typography, theming, and utility layers.",
  "frontend/src/main.tsx": "Application entry point setting up React, Internet Identity provider, React Query, and global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, container settings, and animation utilities.",
  "project_state.json": "Contains project metadata, design notes, and a list of existing features for a minimalistic marketing website for the Vandan brand, including theme requirements and section structure. It outlines color palette decisions, an About-section photo placeholder, and no known issues."
}