{
  "kind": "build_request",
  "title": "Take down (disable) the live website by enabling maintenance mode",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Implement a site-wide maintenance mode that effectively takes the website offline by rendering only a simple unavailable screen instead of the marketing content, and enable it by default so the current production site is taken down after deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "first take down the website"
        ]
      },
      "acceptanceCriteria": [
        "When maintenance mode is enabled, the app does not render HeaderNav, Hero, About, Services, Process, ColorPlaceholders, Contact, or Footer content (no scrolling sections should be accessible).",
        "When maintenance mode is enabled, the app renders a single centered screen with English text that clearly states the site is currently unavailable (e.g., title + short message).",
        "Maintenance mode can be turned off via a single configuration switch (e.g., a constant or environment-based flag) without deleting existing section code.",
        "No changes are made to any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; do not introduce additional canisters or services.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Deleting the canister, changing DNS, or performing infrastructure-level unpublishing outside of code/deployment.",
    "Adding authentication or admin panels for toggling maintenance mode at runtime."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}