{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Site-wide maintenance mode (enabled by default)",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Add a site-wide maintenance mode that replaces all marketing sections with a single unavailable screen, enabled by default and toggleable via one config switch.",
      "acceptanceCriteria": [
        "When maintenance mode is enabled, the app does not render HeaderNav, Hero, About, Services, Process, ColorPlaceholders, Contact, or Footer content (no scrolling sections should be accessible).",
        "When maintenance mode is enabled, the app renders a single centered screen with English text that clearly states the site is currently unavailable (e.g., title + short message).",
        "Maintenance mode can be turned off via a single configuration switch (e.g., a constant or environment-based flag) without deleting existing section code.",
        "No changes are made to any files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/maintenance.ts",
          "operation": "create",
          "description": "Create a single-switch maintenance-mode configuration (enabled by default) that can be turned off by changing one constant or an environment-driven flag."
        },
        {
          "path": "frontend/src/components/maintenance/MaintenanceScreen.tsx",
          "operation": "create",
          "description": "Create a simple full-viewport, centered maintenance screen with English title + short message; ensure the layout prevents access to/visibility of marketing sections while enabled."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire maintenance mode into the top-level app: when enabled, render only the MaintenanceScreen and do not render HeaderNav, marketing sections, background texture layer, or Footer; when disabled, render the existing marketing site unchanged."
        }
      ]
    }
  ]
}